
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипЗначенияХранилища = "Строка";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиПлатформами(Команда)
	ЗаполнитьПлатформамиКонстанту();		
КонецПроцедуры


Процедура ЗаполнитьПлатформамиКонстанту()
	Если ТипЗначенияХранилища = "Строка" ИЛИ ТипЗначенияХранилища = "ТаблицаЗначений"  ИЛИ ТипЗначенияХранилища = "Массив" Тогда 
		Если ТипЗначенияХранилища = "Строка" Тогда
			ЗаписатьЗначениеВХранилище(ПолучитьКодыПлатформыВВидеСтроки());
		ИначеЕсли ТипЗначенияХранилища = "ТаблицаЗначений" Тогда 
			ЗаписатьЗначениеВХранилище(ПолучитьТаблицуЗначенийСсылокПлатформ());
		Иначе
			ЗаписатьЗначениеВХранилище(ПолучитьМассивСсылокПлатформ());
		КонецЕсли;
	Иначе
		Сообщить("Выберите тип хранения в хранилище");
	КонецЕсли;	
	
КонецПроцедуры    


Процедура ЗаписатьЗначениеВХранилище(Данные)
	ПлатформыРезерв = Константы.ПлатформыРезерв.СоздатьМенеджерЗначения(); 
	ПлатформыРезерв.Значение = Новый ХранилищеЗначения(Данные);
	ПлатформыРезерв.Записать();
	Сообщить("Данные были записаны в хранилище");
КонецПроцедуры  


Функция ПолучитьТаблицуЗначенийСсылокПлатформ()
	ПлатформыЗапрос = Новый Запрос("ВЫБРАТЬ
	|	Платформы.Ссылка КАК Ссылка,
	|	Платформы.ЧисловойКод КАК ЧисловойКод
	|ИЗ
	|	Справочник.Платформы КАК Платформы
	|ГДЕ
	|	Платформы.ПометкаУдаления = ЛОЖЬ");
	ПлатформыТЗ = ПлатформыЗапрос.Выполнить().Выгрузить();
	Возврат ПлатформыТЗ;
КонецФункции

Функция ПолучитьМассивСсылокПлатформ()  
	МассивСсылокПлатформ = Новый Массив;
	ПлатформыТЗ = ПолучитьТаблицуЗначенийСсылокПлатформ();
	Для каждого Платформа Из ПлатформыТЗ Цикл
		МассивСсылокПлатформ.Добавить(Платформа.Ссылка);	
	КонецЦикла;	
	Возврат МассивСсылокПлатформ;
КонецФункции   

Функция ПолучитьКодыПлатформыВВидеСтроки()  
	КодыПлатформ = "";
	ПлатформыТЗ = ПолучитьТаблицуЗначенийСсылокПлатформ();
	Для каждого Платформа Из ПлатформыТЗ Цикл
		КодыПлатформ = КодыПлатформ + Платформа.ЧисловойКод + ";";	
	КонецЦикла;	    
	Возврат Сред(КодыПлатформ, 0, СтрДлина(КодыПлатформ) - 1);
КонецФункции


&НаКлиенте
Процедура УдалитьНеКлючевые(Команда)
	ОчиститьСообщения();
	УдалитьНеКлючевыеНаСервере();
КонецПроцедуры

Процедура УдалитьНеКлючевыеНаСервере() 
	
	ПлатформыХранилища = Константы.ПлатформыРезерв.Получить().Получить();
	МассивПлатформУдаленных = Новый Массив;           
	Индекс = 0;
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	ТЗСтрока = "ПлатформыХранилищаПослеУдаления"; 

	Если ТипЗнч(ПлатформыХранилища) = Тип("Массив") Тогда  
		ТипЗначенияХранилища = "Массив";
		Ссылка = Неопределено;
		Пока Индекс < ПлатформыХранилища.Количество() Цикл
			Ссылка = ПлатформыХранилища[Индекс];
			Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.ПометкаУдаления И Не Ссылка.Ключевая Тогда
				МассивПлатформУдаленных.Добавить(Ссылка);
				ПлатформыХранилища.Удалить(Индекс);
			Иначе 
				Индекс = Индекс + 1;
			КонецЕсли;   
		КонецЦикла; 
		
		ВыполнитьОбработкуДанных(ПлатформыХранилища, МассивПлатформУдаленных);
		
	ИначеЕсли ТипЗнч(ПлатформыХранилища) = Тип("ТаблицаЗначений") Тогда
		ТипЗначенияХранилища = "ТаблицаЗначений";
		Пока Индекс < ПлатформыХранилища.Количество() Цикл
			Стр = ПлатформыХранилища[Индекс];
			Ссылка = Стр.Ссылка;
			Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.ПометкаУдаления И Не Ссылка.Ключевая Тогда
				МассивПлатформУдаленных.Добавить(Ссылка);
				ПлатформыХранилища.Удалить(Стр); 
			Иначе 
				Индекс = Индекс + 1;
			КонецЕсли;
		КонецЦикла;
		
		ВыполнитьОбработкуДанных(ПлатформыХранилища, МассивПлатформУдаленных);
		
	ИначеЕсли ТипЗнч(ПлатформыХранилища) = Тип("Строка") Тогда
		ТипЗначенияХранилища = "Строка";
		МассивКодов = СтрРазделить(ПлатформыХранилища, ";");
		Пока Индекс < МассивКодов.Количество() Цикл
			СтрGUID = МассивКодов[Индекс];
			Попытка
				Ссылка = Справочники.Платформы.НайтиПоРеквизиту("ЧисловойКод", Число(СтрGUID));
				Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.ПометкаУдаления И Не Ссылка.Ключевая Тогда
					МассивПлатформУдаленных.Добавить(Ссылка);
					МассивКодов.Удалить(Индекс); 
				Иначе 
					Индекс = Индекс + 1;
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЦикла;
		
		НоваяСтрокаДляХранилища = "";
		Для Каждого Код Из МассивКодов Цикл
			НоваяСтрокаДляХранилища = НоваяСтрокаДляХранилища + Код + ";";
		КонецЦикла;
		
		ПлатформыХранилища = Сред(НоваяСтрокаДляХранилища, 0, СтрДлина(НоваяСтрокаДляХранилища) - 1);   
		
		ВыполнитьОбработкуДанных(ПлатформыХранилища, МассивПлатформУдаленных);
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ВыполнитьОбработкуДанных(ПлатформыХранилища, МассивПлатформУдаленных)
	
	ЗаписатьЗначениеВХранилище(ПлатформыХранилища);   
	Если ТипЗначенияХранилища = "Строка" Тогда
		Платформы = СтрРазделить(ПлатформыХранилища, ";"); 
		НастройкаРеквизитовИЭлементовТаблицыЗначений(Платформы.Количество());  
	Иначе
		НастройкаРеквизитовИЭлементовТаблицыЗначений(ПлатформыХранилища.Количество()); 
	КонецЕсли;
	
	ОтобразитьТабличнуюЧастьНаФорму(ПлатформыХранилища);
	ОтобразитьНаФормуСообщение(МассивПлатформУдаленных);
	
КонецПроцедуры

Процедура НастройкаРеквизитовИЭлементовТаблицыЗначений(КоличествоПлатформ)
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	ТЗСтрока = "ПлатформыХранилищаПослеУдаления"; 
	
	Для Счетчик = 1 По КоличествоПлатформ Цикл 
		ТипРеквизитаСтрока = Новый ОписаниеТипов("СправочникСсылка.Платформы"); 
		ИмяПлатформы = "Платформа" + Счетчик;
		НовыйРеквизит = Новый РеквизитФормы(ИмяПлатформы, ТипРеквизитаСтрока, ТЗСтрока, ТЗСтрока);
		Попытка
			РеквизитСтарый = ЭтотОбъект.ПлатформыХранилищаПослеУдаления[0][ИмяПлатформы];
		Исключение
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		КонецПопытки;
	КонецЦикла;	   
	
	Если ЗначениеЗаполнено(ПлатформыХранилищаПослеУдаления) Тогда
		ПлатформыХранилищаПослеУдаления.Очистить();
	КонецЕсли; 
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	Для Каждого ДобавляемыйРеквизит Из МассивДобавляемыхРеквизитов Цикл
		ИмяПлатформы = ДобавляемыйРеквизит.Имя;
		Попытка
			ЭлементСтарый = Элементы.ПлатформыХранилищаПослеУдаления.ПодчиненныеЭлементы[ИмяПлатформы];
		Исключение
			ПлатформаЭлемент = Элементы.Добавить(ИмяПлатформы, Тип("ПолеФормы"), Элементы.ПлатформыХранилищаПослеУдаления);
			ПлатформаЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			ПлатформаЭлемент.ПутьКДанным = ТЗСтрока + "." + ИмяПлатформы;
			ПлатформаЭлемент.Заголовок = ИмяПлатформы; 
		КонецПопытки;
	КонецЦикла; 
		
КонецПроцедуры


Процедура ОтобразитьТабличнуюЧастьНаФорму(ПлатформыХранилища)
	ПлатформыХранилищаПослеУдаления.Добавить();
	Платформы = Новый Массив;
	Если ТипЗначенияХранилища = "Строка" Тогда  
		Платформы = СтрРазделить(ПлатформыХранилища, ";"); 
		ОтобразитьЭлементыВЦикле(Платформы); 
	Иначе    
		ОтобразитьЭлементыВЦикле(ПлатформыХранилища); 
	КонецЕсли;	
	
	СтолбцыКоличество = 0;
	Попытка 
		СтолбцыКоличество = Элементы.ПлатформыХранилищаПослеУдаления.ПодчиненныеЭлементы.Количество(); 
	Исключение 
	КонецПопытки;       
	
	Если ТипЗначенияХранилища = "Строка" Тогда
		Если Не ЗначениеЗаполнено(ПлатформыХранилища) Тогда
			Индекс = 1;			 
		Иначе
			Индекс = Платформы.Количество() + 1; 
		КонецЕсли;
	Иначе
		Индекс = ПлатформыХранилища.Количество() + 1; 
	КонецЕсли;
	
	Пока Индекс <= СтолбцыКоличество Цикл
		ЭтаФорма.Элементы["Платформа" + Индекс].Видимость = Ложь; 
		Индекс = Индекс + 1;
	КонецЦикла;  
		
КонецПроцедуры      

Процедура ОтобразитьЭлементыВЦикле(Платформы)  
	Индекс = 1;
	Для Каждого Платформа Из Платформы Цикл  
		Если ТипЗначенияХранилища = "Строка" Тогда
			ПлатформыХранилищаПослеУдаления[0]["Платформа" + Индекс] = Справочники.Платформы.НайтиПоРеквизиту("ЧисловойКод", Число(Платформа)); 
		Иначе
			ПлатформыХранилищаПослеУдаления[0]["Платформа" + Индекс] = Платформа.Ссылка;	
		КонецЕсли;
		ЭтаФорма.Элементы["Платформа" + Индекс].Видимость = Истина;   
		Индекс = Индекс + 1;
	КонецЦикла;  
КонецПроцедуры


Процедура ОтобразитьНаФормуСообщение(МассивПлатформУдаленных)
	КоличествоУдаленных = 0;
	ПлатформыВСтроку = "";                                            
	Для каждого Ссылка Из МассивПлатформУдаленных Цикл
		ПлатформыВСтроку = ПлатформыВСтроку + Строка(Ссылка.Наименование) + ",";
	КонецЦикла;
	ПлатформыВСтроку = Сред(ПлатформыВСтроку, 0, СтрДлина(ПлатформыВСтроку) - 1);
	Сообщить("Удалено платформ: " + МассивПлатформУдаленных.Количество() + " (" + ПлатформыВСтроку + ")");
КонецПроцедуры

